Documents/ОказаниеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОказаниеУслуги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОказаниеУслуги/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
перем НаценкаНаУслугу;
перем СтокЗаголовок;

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	Сообщить("Выполнеение процедуры при изменении значениия Количества формы ПереченьНоменклатуры");
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	НаценкаНаУслугу = 1.5;
	Красный = Элементы.ПереченьНоменклатурыЦена.ЦветФона.Красный;
	Элементы.ПереченьНоменклатурыЦена.ЦветФона = Новый Цвет(77, 240, 26);
	Сообщить("Выполнеение процедуры при изменении значениия Цена формы ПереченьНоменклатуры");
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.СделатьНаценку(ТекущийДокумент, НаценкаНаУслугу);
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Элемент)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
		Объект.Дата, СтрокаТабличнойЧасти.Номенклатура
	);
	Сообщить("Получена последняя цена из регистра сведений");
	// Пересчитать сумму строки
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
